app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT * FROM "orders"

  def create
    @order = Order.new(params[:order])

    if @order.save
---
INSERT INTO "orders" ("phone", "created_at", "name", "payment_option", "amount", "address", "order_status", "delivery_date", "updated_at", "product_id") VALUES('123456', '2021-07-08 02:44:50', 'Alice', 'Prepay (Full)', 123, 'Yangon', 'Confirm', '2021-05-02', '2021-07-08 02:44:50', '112')

  def show
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 1)

  def edit
    @order = Order.find(params[:id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 1)

  def update
    @order = Order.find(params[:id])

    if @order.update_attributes(params[:order])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 1)
UPDATE "orders" SET "updated_at" = '2021-07-08 05:22:52', "product_id" = '1121' WHERE "id" = 1