app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("updated_at", "name", "encrypted_password", "created_at", "salt", "email", "reset_sent_at", "reset_digest", "password") VALUES('2021-08-03 06:53:20', 'Foo Bar', 'c781a0a2093ba3b8d590c68e0cbf3be0b3ec9e82669b227f191efbb0ec8bc89e', '2021-08-03 06:53:20', NULL, 'amazone.imp@gmail.com', NULL, NULL, NULL)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 4) LIMIT 1
UPDATE "users" SET "updated_at" = '2021-07-12 09:03:22', "encrypted_password" = '7bdee28115812e774aa74f4271e1903860633c887722e62f37a9d3199f3ab62d' WHERE "id" = 4